___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:120%; text-align:center; border-radius:10px 10px;">Way to Reinvent Yourself</p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 10</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Working with Text & Time Data</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [WORKING WITH TEXT DATA](#0)
* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#00)
* [WORKING WITH TIME DATA](#1)
    * [String Methods](#1.1)
    * [Most Usefull String Methods](#1.2)
    * [Dummy Operations](#1.3)
* [WORKING WITH TIME DATA](#2)
    * [pd.to_datetime()](#2.1)
    * [Series.dt()](#2.2)
    * [Datetime Module](#2.3)
    * [Series.dt()](#2.4)
* [OPERATION WITH DATETIME OBJECT](#3)
* [THE END OF THE SESSION](#4)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="00"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [387]:
import numpy as np
import pandas as pd
import seaborn as sns

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Working with Text Data</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In this notebook, we will first discuss the string operations with our basic Series/Index and learn how to apply these string functions on the DataFrame.

Pandas provides a set of string functions which make it easy to operate on string data. Most importantly, these functions ignore (or exclude) missing/NaN values. Almost, all of these methods work with Python string functions [Refer To Official Python Documentation]( https://docs.python.org/3/library/stdtypes.html#string-methods). So, while studying with the Series Object, convert it to String Object and then perform the operation.

In addition, according to [Pandas Official Document](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html), there are two ways to store text data in pandas:
- object -dtype NumPy array.
- StringDtype extension type.

Pandas recommend using StringDtype to store text data.

[SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html), [SOURCE02](https://www.w3schools.com/python/python_ref_string.asp)

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">String Methods</p>

<a id="1.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Strings implement all of the common sequence operations, along with the additional methods described at [the official documentation](https://docs.python.org/3/library/stdtypes.html#string-methods).

Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (**Please see the information about** [str.format()](https://docs.python.org/3/library/stdtypes.html#str.format), [Format String Syntax](https://docs.python.org/3/library/string.html#formatstrings) and [Custom String Formatting](https://docs.python.org/3/library/string.html#string-formatting)) and the other based on C printf style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle ([printf-style String Formatting](https://docs.python.org/3/library/stdtypes.html#old-string-formatting)).

The [Text Processing Services](https://docs.python.org/3/library/text.html#textservices) section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the [re](https://docs.python.org/3/library/re.html#module-re) module).

Please watch [**``Video Source``**](https://www.youtube.com/watch?v=6JNwK6hEneg) for enhancing your understanding of working with Text Data in Pandas.  

**What are these String Methods? Now let us examine some of the most common and usefull String Methods and dig into them one by one:**

In [388]:
df = pd.read_excel("text_exercise.xlsx")
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMÄ°TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [389]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Most Usefull String Methods</p>

<a id="1.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- **str.lower() =>** Converts a string into lower case
- **str.upper() =>** Converts a string into upper case
- **str.capitalize() =>** Converts the first character to upper case
- **str.title() =>** Converts the first character of each word to upper case
- **str.swapcase() =>** Swaps the case lower/upper

[SOURCE01](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm)
[SOURCE02](https://www.aboutdatablog.com/post/10-most-useful-string-functions-in-pandas)
[SOURCE03](https://towardsdatascience.com/5-must-know-pandas-operations-on-strings-4f88ca6b8e25)
[SOURCE04](https://towardsdatascience.com/pandas-string-operations-explained-fdfab7602fb4)
[SOURCE05](https://blog.devgenius.io/string-operations-on-pandas-dataframe-88af220439d1)
[SOURCE06](https://www.geeksforgeeks.org/string-manipulations-in-pandas-dataframe/)

___

In [390]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMÄ°TH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [391]:
df.staff.lower() # python str fonksiyonlarÄ± serilerle Ã§alÄ±Åmaz.

AttributeError: 'Series' object has no attribute 'lower'

In [392]:
# Serilerde str metodlarÄ±nÄ± Ã§alÄ±ÅtÄ±rmak iÃ§in str.metod Åeklinde kullanÄ±lnalÄ±dÄ±r.

df.staff.str.lower()  # staff sÃ¼tunundaki ifadeleri kÃ¼Ã§Ã¼k harf yapmak iÃ§in

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smiÌth
6      adrian star
7     albert simon
Name: staff, dtype: object

In [393]:
df.staff.str.upper()  # staff sÃ¼tunundaki ifadeleri bÃ¼yÃ¼k harf yapmak iÃ§in

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMÄ°TH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object

In [394]:
df.staff.str.title()  # staff sÃ¼tunundaki ifadelerin baÅ harflerini bÃ¼yÃ¼k harf yapmak iÃ§in

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar SmiÌth
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

In [395]:
df.staff.str.capitalize()  # staff sÃ¼tunundaki ifadelerin  ilk harflerini bÃ¼yÃ¼k harf yapmak iÃ§in

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smiÌth
6      Adrian star
7     Albert simon
Name: staff, dtype: object

In [396]:
df.staff.str.swapcase()  # staff sÃ¼tunundaki ifadelerin bÃ¼yÃ¼k harflerini kÃ¼Ã§Ã¼k, kÃ¼Ã§Ã¼k harflerini bÃ¼yÃ¼k harf yapmak iÃ§in

0         tOM blue
1       john black
2    mICHEAL bROWN
3     JASON WALKER
4       aLEX gREEN
5     oscar smiÌth
6      aDRIAN star
7     aLBERT SIMON
Name: staff, dtype: object

In [397]:
df.staff.str.casefold()  # staff sÃ¼tunundaki ifadeleri kÃ¼Ã§Ã¼k harf yapmak iÃ§in (2. yol)

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smiÌth
6      adrian star
7     albert simon
Name: staff, dtype: object

___

- **str.isalpha()     =>** Returns True if all characters in the string are in the alphabet
- **str.isnumeric()   =>** Returns True if all characters in the string are numeric
- **str.isalnum()     =>** Returns True if all characters in the string are alphanumeric
- **str.endswith()	  =>** Returns true if the string ends with the specified value
- **str.startswith()  =>** Returns true if the string starts with the specified value
- **str.contains()	  =>** Returns a Boolean value True for each element if the substring contains in the element, else False.

[SOURCE01](https://careerkarma.com/blog/python-isalpha-isnumeric-isalnum/)
[SOURCE02](https://careerkarma.com/blog/python-startswith-and-endswith/)
[SOURCE03](https://www.geeksforgeeks.org/python-startswith-endswidth-function/)
[SOURCE04](https://towardsdatascience.com/check-for-a-substring-in-a-pandas-dataframe-column-4b949f64852#:~:text=The%20contains%20method%20in%20Pandas,str.)

In [398]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMÄ°TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

**isalpha()** Function in pandas python checks whether the string consists of alphabetic characters only. It returns True when alphabetic value is present and it returns False when the alphabetic value is not present.

In [399]:
df.job.str.isalpha()  

# job sÃ¼tunundaki verilerin tamamÄ± harf olanlar iÃ§in True, harf dÄ±ÅÄ±nda karakter(space dahil) olanlar iÃ§in False dÃ¶ner.

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

**isnumeric()** checks whether all characters in each string are numeric. This is equivalent to running the Python string method str. isnumeric() for each element of the Series/Index.

In [400]:
df.age.str.isnumeric()  # job sÃ¼tunundaki verilerin tamamÄ± numerik olanlar iÃ§in True, olmayanlar iÃ§in False dÃ¶ner.

# Ancak burada veri tipleri int old iÃ§in str metodu Ã§alÄ±ÅmadÄ± ve NaN dÃ¶ndÃ¼.

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [401]:
type(df.age[0])  # veriler int old. iÃ§in yukarÄ±da str metodu Ã§alÄ±ÅmadÄ±.

int

In [402]:
df.age.astype("str").str.isnumeric()  # Ãnce verilerimizi str yaparsak str metodunu kullanabiliriz.

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: age, dtype: bool

**isalnum()** Function in python checks whether the string consists of alphanumeric characters. It returns True when alphanumeric value is present and it returns False when the alphanumeric value is not present. Alphanumeric means a character that is either a letter or a number.

In [403]:
df.salary

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

In [404]:
df.salary.str.isalnum()  # salary sÃ¼tunundaki verilerden harf ve numerik karakter iÃ§ierenler iÃ§in True, diÄerleri iÃ§in False dÃ¶ner.

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

Pandas **startswith()** tests if the start of each string element matches a pattern. It is yet another method to search and filter text data in Series or Data Frame. This method is Similar to Pythonâs startswith() method, but has different parameters and it works on Pandas objects only. Hence .str has to be prefixed everytime before calling this method, so that the compiler knows that itâs different from default function.

In [405]:
df.job.str.startswith("data") # job sÃ¼tunundaki verilerden data ile baÅlayanlar True, baÅlamayanlar False dÃ¶ner.

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

Pandas **endswith()** method is a built-in function that determines whether the given string ends with a specific sequence of characters.

In [406]:
df.job.str.endswith("per")  # job sÃ¼tunundaki verilerden per ile bitenler True, bitmeyenler False dÃ¶ner.

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

The **contains()** method in Pandas allows you to search a column for a specific substring. The contains method returns boolean values for the Series with True for if the original Series value contains the substring and False if not [SOURCE](https://towardsdatascience.com/check-for-a-substring-in-a-pandas-dataframe-column-4b949f64852#:~:text=The%20contains%20method%20in%20Pandas,str.).

In [407]:
df.job.str.contains("data")  # job sÃ¼tunundaki verilerden iÃ§inde data ifadesi geÃ§enleri bulmak iÃ§in

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [410]:
df.salary.str.contains("[a-z]+") 

# salary sÃ¼tununda harf iÃ§eren ifadeleri bulmak iÃ§in regex patterni olarak yazdÄ±k.
# regex default True old. iÃ§in regex olarak aradÄ±.

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

we can use these string methods which returning boolean expression for creating condition and so selecting relative rows

In [411]:
df.loc[df.job.str.contains("data")]  # iÃ§inde data ifadesi geÃ§enleri filtreleyerek df olarak getirdik.

      id          staff department             job       salary age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35
6  E0005    Adrian STAR         IT  data scientist   "$135,000"  40
7  E0006   Albert simon         IT  data scientist  125000dolar  35

In [412]:
df.loc[df.job.str.contains("data"), "department"] = "DS"  # iÃ§inde data ifadesi geÃ§enlerin department deÄerlerini DS yaptÄ±k.
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         DS      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMÄ°TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         DS      data scientist   "$135,000"  40
7  E0006   Albert simon         DS      data scientist  125000dolar  35

In [413]:
df.loc[df.job.str.contains("data"), "department"] = "IT"  # iÃ§inde data ifadesi geÃ§enlerin department deÄerlerini tekrar IT yaptÄ±k.
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMÄ°TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

___

- **str.strip()	=>** Returns a trimmed version of the string

- **str.replace() =>** Returns a string where a specified value is replaced with a specified value

- **str.split()	=>** Splits the string at the specified separator, and returns a list

- **str.find()	=>** Searches the string for a specified value and returns the position of where it was found

- **str.findall()	=>** Returns a list of all occurrence of the pattern.

- **str.join()	=>** Converts the elements of an iterable into a string

___

In [414]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMÄ°TH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

**NOTE:** For a better using and understanding of strip, please revise escape characters in python [Source01 for Escape Characters](https://www.python-ds.com/python-3-escape-sequences) & [Source02 for Escape Characters](https://www.w3schools.com/python/gloss_python_escape_characters.asp)

In [415]:
df.salary.str.strip('""')  # salary sÃ¼tunundaki verilerin iki tarafÄ±ndaki tÄ±rnak iÅaretlerinden kurtulmak iÃ§in

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [416]:
df.salary.str.strip("\"")  # regex pattern olarak \" ifadesi tÄ±rnak iÅaretinin gerÃ§ek tÄ±rnak iÅareti olarak algÄ±lanmasÄ±nÄ± saÄlar.

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [417]:
df.salary.str.strip("\"").str.rstrip("dolar")  # saÄ tarafÄ±nda dolar ifadesi olanlarÄ± temizlemek iÃ§in

0    $150,000
1    $180,000
2    $150,000
3      130000
4    $110,000
5    $120,000
6    $135,000
7      125000
Name: salary, dtype: object

In [418]:
df.salary.str.strip("\"").str.rstrip("dolar").str.lstrip("$")  # sol tarafÄ±nda $ iÅareti olanlarÄ± temizlemek iÃ§in

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [419]:
df.salary.str.strip("\"$dolar")  # YukarÄ±daki iÅlemleri tek seferde regex patterni yazarak yaptÄ±k.

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [420]:
df.salary.str.strip("\"$dolar").replace(",","")  # satÄ±rda sadece virgÃ¼l varsa iÅlem yapar. Yani tek baÅÄ±na virgÃ¼lÃ¼ arar. Bu nedenle burada deÄiÅiklik yapmadÄ±.

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [421]:
df.salary.str.strip("\"$dolar").str.replace(",","")  # satÄ±rÄ±n tamamÄ±na bakar, bir tane bile virgÃ¼l bulursa deÄiÅtirir.

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

In [422]:
df.salary.str.strip("\"$dolar").str.replace(",","").astype("int")  # YukarÄ±da salary sÃ¼tunundaki verileri temizlemek iÃ§in yaptÄ±ÄÄ±mÄ±z tÃ¼m iÅlemleri burada regex yazarak tek seferde yaptÄ±k.

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: int32

In [423]:
df["salary"] = df.salary.str.strip("\"$dolar").str.replace(",","").astype("int")  # deÄiÅiklikleri kalÄ±cÄ± yapmak iÃ§in

In [424]:
df.age.replace("-", np.nan)  # bu iÅlemi str ile yapacak olsaydÄ±k hata verirdi. ÃÃ¼ngÃ¼ veri tÃ¼rleri int.(- hariÃ§)

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

In [425]:
df["age"] = df.age.replace("-", np.nan)  # age sÃ¼tunundaki deÄiÅikliÄi kalÄ±cÄ± yaptÄ±k.

In [427]:
df.info()  # age sÃ¼tunundaki - yerine np.nan yazdÄ±ÄÄ±mÄ±z iÃ§in veri tÃ¼tÃ¼ de float'a dÃ¶ndÃ¼.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      int32
 5   age         7 non-null      float64
dtypes: float64(1), int32(1), object(4)
memory usage: 480.0+ bytes

### ``str.replace()`` vs **``.replace()``

- **Purpose:** Use **str.replace** for substring replacements on a single string column, and **replace** for any general replacement on one or more columns.

- **Usage:** **str.replace** can replace one thing at a time. **replace** lets you perform multiple independent replacements, i.e., replace many things at once.

- **Default behavior:** **str.replace** enables regex replacement by default. **replace** only performs a full match unless the regex=True switch is used.

**Indexing with .str[]** 

You can use [] notation to directly index by position locations [SOURCE](https://pandas.pydata.org/pandas-docs/version/0.15/text.html).

In [428]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMÄ°TH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [429]:
df.staff.str.title().str.split().str[1]

# bir serideki string verileri indexlemek iÃ§in .str[] metodu kullanÄ±lÄ±r.
# Burada staff sÃ¼tunundaki isimleri Ã¶nce title case yaptÄ±k. sonra split ile elemanlarÄ±na ayÄ±rarak liste yaptÄ±k.
# Sonra da listenin 0. elemanÄ±nÄ± alarak tÃ¼m serideki firs name lere ulaÅtÄ±k.

0      Blue
1     Black
2     Brown
3    Walker
4     Green
5    SmiÌth
6      Star
7     Simon
Name: staff, dtype: object

In [430]:
# staff sÃ¼tunundaki verileri first_name ve last_name olarak ayÄ±rÄ±p, iki ayrÄ± sÃ¼tun haline getirmek iÃ§in
df["first_name"] = df.staff.str.title().str.split().str[0]
df["last_name"] = df.staff.str.title().str.split().str[1]
df.drop("staff", axis=1, inplace=True)

In [431]:
df

      id department                 job  salary   age first_name last_name
0  M0001         HR             manager  150000  52.0        Tom      Blue
1  M0002         IT             manager  180000  48.0       John     Black
2  E0001         IT      data scientist  150000  35.0    Micheal     Brown
3  E0002         HR           recruiter  130000  38.0      Jason    Walker
4  E0003         IT   backend developer  110000   NaN       Alex     Green
5  E0004         IT  frontend developer  120000  32.0      Oscar    SmiÌth
6  E0005         IT      data scientist  135000  40.0     Adrian      Star
7  E0006         IT      data scientist  125000  35.0     Albert     Simon

**str.find** returns lowest indexes in each strings in the Series/Index. Each of returned indexes corresponds to the position where the substring is fully contained between [start:end]. Return -1 on failure. Equivalent to standard str.find().

**str.rfind** returns highest indexes in each strings in the Series/Index. Each of returned indexes corresponds to the position where the substring is fully contained between [start:end]. Return -1 on failure. Equivalent to standard str.rfind().

In [432]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [433]:
df.job.str.find("developer")  # -1 olanlar developer ifadesi olmayanlar. 8: ilgili sÃ¼tundaki verinin 8. indexinden itibaren baÅlÄ±yor, 9: ilgili sÃ¼tunun 9. indexinden itibaren baÅlÄ±yor.

0   -1
1   -1
2   -1
3   -1
4    8
5    9
6   -1
7   -1
Name: job, dtype: int64

**str.findall** finds all occurrences of pattern or regular expression in the Series/Index [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.findall.html).

In [434]:
df.job.str.findall("developer") # "developer" varsa o satÄ±rda o ifadeden kaÃ§ tane varsa getirir. ÃrneÄin;

# NOT: find ve findall Ã§ok kullanÄ±lmÄ±yor

0             []
1             []
2             []
3             []
4    [developer]
5    [developer]
6             []
7             []
Name: job, dtype: object

In [435]:
df.job.str.findall("d")  # job sÃ¼tunu verilerinde kaÃ§ tane d harfi varsa getirir.

0        []
1        []
2       [d]
3        []
4    [d, d]
5    [d, d]
6       [d]
7       [d]
Name: job, dtype: object

In [436]:
df.job.str.findall("d").apply(len)  # bu Åekilde de kaÃ§ tane d olduÄunu bulabiliriz.

0    0
1    0
2    1
3    0
4    2
5    2
6    1
7    1
Name: job, dtype: int64

In [437]:
# df'e iki tane skills sÃ¼tunu ekleyelim. FarklarÄ±nÄ± inceleyelim.
# skills sÃ¼tununda tÃ¼m veriler liste iÃ§inde
# Skills sÃ¼tununda ise bazÄ±larÄ± liste iÃ§inde iken, bazÄ±larÄ± deÄil

df["skills"] = [[],["Java","C++"],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df["Skills"] = [[],[],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df.loc[1, "Skills"] = "Java,C++"
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000,52.0,Tom,Blue,[],[]
1,M0002,IT,manager,180000,48.0,John,Black,"[Java, C++]","Java,C++"
2,E0001,IT,data scientist,150000,35.0,Micheal,Brown,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,E0002,HR,recruiter,130000,38.0,Jason,Walker,[],[]
4,E0003,IT,backend developer,110000,NaN,Alex,Green,"[React, Django]","[React, Django]"
5,E0004,IT,frontend developer,120000,32.0,Oscar,SmiÌth,"[JavaScript, Python]","[JavaScript, Python]"
6,E0005,IT,data scientist,135000,40.0,Adrian,Star,"[R, SQL]","[R, SQL]"
7,E0006,IT,data scientist,125000,35.0,Albert,Simon,"[SQL, Python]","[SQL, Python]"

If the elements of a Series are lists themselves, join the content of these lists using the delimiter passed to the function. This function is an equivalent to str.join() [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.join.html).

**Join** lists contained as elements in the Series/Index with passed delimiter.

In [438]:
df.skills.str.join(",")  # join metodu liste iÃ§inde verilen seri elemanlarÄ±nÄ± belirtilen ayraca gÃ¶re birleÅtirir.

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: skills, dtype: object

In [439]:
df.Skills.str.join(",")  # Skills sÃ¼tununda liste iÃ§inde olmayan veriler vardÄ±. Bunlara join yapÄ±nca yapÄ±sÄ±nÄ± bozdu. Biz bunu istemiyoruz.

0
1       J,a,v,a,,,C,+,+
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [440]:
# Liste iÃ§inde olmayan verileri de iÃ§eren Skills sÃ¼tununun her elemanÄ±nÄ±n liste olup olmadÄ±ÄÄ±nÄ± kontrol edip,
# liste ise join yaparÄ±z, deÄilse verinin kendisini alÄ±rÄ±z. Bunu lambda ile aÅaÄÄ±daki gibi yapabiliriz.

df.Skills.apply(lambda x : ",".join(x) if type(x) == list else x)  # her elemanÄ±n liste olup olmadÄ±ÄÄ±nÄ± kontrol edip, liste ise join iÅlemi yaptÄ±k. DeÄilse kendisini aldÄ±k.

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [441]:
 # Bu da Skills kolonundaki verilerin list comprehension ile dÃ¼zenlenmesi

[",".join(x) if type(x) == list else x for x in df["Skills"]]

['',
 'Java,C++',
 'Python,Tableau,SQL',
 '',
 'React,Django',
 'JavaScript,Python',
 'R,SQL',
 'SQL,Python']

In [442]:
df["Skills"] = [",".join(x) if type(x) == list else x for x in df["Skills"]]  # temizlenmiÅ verileri sÃ¼tumnumuza kalÄ±cÄ± olarak yerleÅtirelim
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000,52.0,Tom,Blue,[],
1,M0002,IT,manager,180000,48.0,John,Black,"[Java, C++]","Java,C++"
2,E0001,IT,data scientist,150000,35.0,Micheal,Brown,"[Python, Tableau, SQL]","Python,Tableau,SQL"
3,E0002,HR,recruiter,130000,38.0,Jason,Walker,[],
4,E0003,IT,backend developer,110000,NaN,Alex,Green,"[React, Django]","React,Django"
5,E0004,IT,frontend developer,120000,32.0,Oscar,SmiÌth,"[JavaScript, Python]","JavaScript,Python"
6,E0005,IT,data scientist,135000,40.0,Adrian,Star,"[R, SQL]","R,SQL"
7,E0006,IT,data scientist,125000,35.0,Albert,Simon,"[SQL, Python]","SQL,Python"

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Dummy Operations</p>

<a id="1.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A dataset may contain various type of values, sometimes it consists of categorical values. So, in-order to use those categorical value for programming efficiently we create dummy variables. A dummy variable is a binary variable that indicates whether a separate categorical variable takes on a specific value [SOURCE](https://www.geeksforgeeks.org/how-to-create-dummy-variables-in-python-with-pandas/).

### get_dummies()

**Syntax1:** ``pd.get_dummies(data, prefix=None, prefix_sep="_",)``<br>
            **OR**<br>
**Syntax2:** ``df["col_name"].get_dummies(sep = ",")``

**Parameters:**
- data= input data i.e. it includes pandas data frame. list . set . numpy arrays etc.
- prefix= Initial value
- prefix_sep= Data values separation.
- Return Type: Dummy variables.

In [332]:
# Bir datasetini modele sokmadan Ã¶nce deÄerlerimizin hepsi nÃ¼merik olmalÄ±.
# Kategorik verileri get_dummies metodu ile numarik deÄerlere dÃ¶nÃ¼ÅtÃ¼rebiliriz.

"""
Series.str.get_dummies(sep= "|")
pd.Series(['p|q','p','p|r']).str.get_dummies()
    p  q  r
0   1  1  0
1   1  0  0
2   1  0  1
"""
"""
pd.get_dummies(arraylike)
pd.get_dummies(Series)
pd.get_dummies(DataFrames)

Color 
                          Red Green Yellow 
Red                   0    1    0      0
Red                   1    1    0      0
Yellow                2    0    1      0
Green                 3    0    0      1
Yellow
"""

'\npd.get_dummies(arraylike)\npd.get_dummies(Series)\npd.get_dummies(DataFrames)\n\nColor \n                          Red Green Yellow \nRed                   0    1    0      0\nRed                   1    1    0      0\nYellow                2    0    1      0\nGreen                 3    0    0      1\nYellow\n'

In [443]:
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000,52.0,Tom,Blue,[],
1,M0002,IT,manager,180000,48.0,John,Black,"[Java, C++]","Java,C++"
2,E0001,IT,data scientist,150000,35.0,Micheal,Brown,"[Python, Tableau, SQL]","Python,Tableau,SQL"
3,E0002,HR,recruiter,130000,38.0,Jason,Walker,[],
4,E0003,IT,backend developer,110000,NaN,Alex,Green,"[React, Django]","React,Django"
5,E0004,IT,frontend developer,120000,32.0,Oscar,SmiÌth,"[JavaScript, Python]","JavaScript,Python"
6,E0005,IT,data scientist,135000,40.0,Adrian,Star,"[R, SQL]","R,SQL"
7,E0006,IT,data scientist,125000,35.0,Albert,Simon,"[SQL, Python]","SQL,Python"

In [444]:
df.department  # department sÃ¼tununda kategorik veriler var. BunlarÄ± dummylerle sayÄ±sal verilere dÃ¶nÃ¼ÅtÃ¼rebiliriz.

0    HR
1    IT
2    IT
3    HR
4    IT
5    IT
6    IT
7    IT
Name: department, dtype: object

In [445]:
pd.get_dummies(df.department)  # get_dummies metodu kategorik verileri sayÄ±sal deÄerlere dÃ¶nÃ¼ÅtÃ¼rÃ¼r.

   HR  IT
0   1   0
1   0   1
2   0   1
3   1   0
4   0   1
5   0   1
6   0   1
7   0   1

As you can see two(2) dummy variables are created for the three categorical values of the "department" attribute. We can create dummy variables in python using **``get_dummies()``** method.

In [447]:
pd.get_dummies(df.department)

   HR  IT
0   1   0
1   0   1
2   0   1
3   1   0
4   0   1
5   0   1
6   0   1
7   0   1

In [448]:
pd.get_dummies(df.department).sum()

HR    2
IT    6
dtype: int64

Dummies with **``drop_first=True``** parameter can be used to drop the first column. drop_first=True is important to use, as it helps in reducing the extra column created during dummy variable creation. Hence it reduces the correlations created among dummy variables. In other words it drops the first dummy to avoid the creation of correlated features [SOURCE](https://stackoverflow.com/questions/63661560/drop-first-true-during-dummy-variable-creation-in-pandas#:~:text=1%20Answer,correlations%20created%20among%20dummy%20variables.).

In [337]:
pd.get_dummies(df.department, drop_first=True)  # modeli etkilemeyeceÄini dÃ¼ÅÃ¼ndÃ¼ÄÃ¼nÃ¼z bir sÃ¼tunu atmak iÃ§in. Burada HR sÃ¼tununu drop ettik.

   IT
0   0
1   1
2   1
3   0
4   1
5   1
6   1
7   1

In [450]:
# virgÃ¼llerle ayrÄ±lmÄ±Å veriler iÃ§eren Skills sÃ¼tununa get_dummies metodunu uygularsak

df.Skills.str.get_dummies(sep=",")  # sep parametresinin default deÄeri |. Bizim verilerimiz virgÃ¼l(,) ile ayrÄ±ldÄ±ÄÄ± iÃ§in sep="," kullandÄ±k.

   C++  Django  Java  JavaScript  Python  R  React  SQL  Tableau
0    0       0     0           0       0  0      0    0        0
1    1       0     1           0       0  0      0    0        0
2    0       0     0           0       1  0      0    1        1
3    0       0     0           0       0  0      0    0        0
4    0       1     0           0       0  0      1    0        0
5    0       0     0           1       1  0      0    0        0
6    0       0     0           0       0  1      0    1        0
7    0       0     0           0       1  0      0    1        0

In [451]:
df.Skills.str.get_dummies(sep=",").add_prefix("Skills_")  # bu kolonlarÄ±n hangi sÃ¼tundan geldiÄini belirtmek iÃ§in prefix ekleyebiliriz.

,Skills_C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau
0,0,0,0,0,0,0,0,0,0
1,1,0,1,0,0,0,0,0,0
2,0,0,0,0,1,0,0,1,1
3,0,0,0,0,0,0,0,0,0
4,0,1,0,0,0,0,1,0,0
5,0,0,0,1,1,0,0,0,0
6,0,0,0,0,0,1,0,1,0
7,0,0,0,0,1,0,0,1,0

In [452]:
skill_dummy = df.Skills.str.get_dummies(sep=",").add_prefix("Skills_")  # deÄiÅiklikleri yeni bir df olarak kaydettik

In [453]:
df

,id,department,job,salary,age,first_name,last_name,skills,Skills
0,M0001,HR,manager,150000,52.0,Tom,Blue,[],
1,M0002,IT,manager,180000,48.0,John,Black,"[Java, C++]","Java,C++"
2,E0001,IT,data scientist,150000,35.0,Micheal,Brown,"[Python, Tableau, SQL]","Python,Tableau,SQL"
3,E0002,HR,recruiter,130000,38.0,Jason,Walker,[],
4,E0003,IT,backend developer,110000,NaN,Alex,Green,"[React, Django]","React,Django"
5,E0004,IT,frontend developer,120000,32.0,Oscar,SmiÌth,"[JavaScript, Python]","JavaScript,Python"
6,E0005,IT,data scientist,135000,40.0,Adrian,Star,"[R, SQL]","R,SQL"
7,E0006,IT,data scientist,125000,35.0,Albert,Simon,"[SQL, Python]","SQL,Python"

In [454]:
df_final = df[["department", "job", "salary", "Skills"]]  # Modelde ihtiyacÄ±mÄ±z olan kolonlarÄ± alarak yeni bir df oluÅturduk
df_final

  department                 job  salary              Skills
0         HR             manager  150000
1         IT             manager  180000            Java,C++
2         IT      data scientist  150000  Python,Tableau,SQL
3         HR           recruiter  130000
4         IT   backend developer  110000        React,Django
5         IT  frontend developer  120000   JavaScript,Python
6         IT      data scientist  135000               R,SQL
7         IT      data scientist  125000          SQL,Python

In [455]:
df_final = df_final.join(skill_dummy)  # skill_dummy ile df_final 'Ä± indexlere gÃ¶re birleÅtirme yapmak iÃ§in join metodu kullandÄ±k
df_final

,department,job,salary,Skills,Skills_C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau
0,HR,manager,150000,,0,0,0,0,0,0,0,0,0
1,IT,manager,180000,"Java,C++",1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000,"Python,Tableau,SQL",0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000,,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000,"React,Django",0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000,"JavaScript,Python",0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000,"R,SQL",0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000,"SQL,Python",0,0,0,0,1,0,0,1,0

In [456]:
df_final.drop("Skills", axis=1, inplace=True) # Skilld kolonunu silmek iÃ§in

In [457]:
df_final

,department,job,salary,Skills_C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau
0,HR,manager,150000,0,0,0,0,0,0,0,0,0
1,IT,manager,180000,1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000,0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000,0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000,0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000,0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000,0,0,0,0,1,0,0,1,0

In [459]:
pd.get_dummies(df_final)  # modele Ã§alÄ±ÅmasÄ±ndan Ã¶nce df_final dataframe' indeki geri kalan kategorik deÄiÅkenler iÃ§in de numerik deÄerleri bulmak iÃ§in

,salary,Skills_C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau,department_HR,department_IT,job_backend developer,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,0
1,180000,1,0,1,0,0,0,0,0,0,0,1,0,0,0,1,0
2,150000,0,0,0,0,1,0,0,1,1,0,1,0,1,0,0,0
3,130000,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1
4,110000,0,1,0,0,0,0,1,0,0,0,1,1,0,0,0,0
5,120000,0,0,0,1,1,0,0,0,0,0,1,0,0,1,0,0
6,135000,0,0,0,0,0,1,0,1,0,0,1,0,1,0,0,0
7,125000,0,0,0,0,1,0,0,1,0,0,1,0,1,0,0,0

In [460]:
pd.get_dummies(df_final, drop_first=True)

,salary,Skills_C++,Skills_Django,Skills_Java,Skills_JavaScript,Skills_Python,Skills_R,Skills_React,Skills_SQL,Skills_Tableau,department_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000,0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,180000,1,0,1,0,0,0,0,0,0,1,0,0,1,0
2,150000,0,0,0,0,1,0,0,1,1,1,1,0,0,0
3,130000,0,0,0,0,0,0,0,0,0,0,0,0,0,1
4,110000,0,1,0,0,0,0,1,0,0,1,0,0,0,0
5,120000,0,0,0,1,1,0,0,0,0,1,0,1,0,0
6,135000,0,0,0,0,0,1,0,1,0,1,1,0,0,0
7,125000,0,0,0,0,1,0,0,1,0,1,1,0,0,0

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Working with Time Data</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

As someone who works with time series data on almost a daily basis, it's clear that the pandas Python package is extremely useful for time series manipulation and analysis. This basic introduction to time series data manipulation with pandas should allow you to get started in your time series analysis. Specific objectives are to show you how to:
- create a date range
- work with timestamp data
- convert string data to a timestamp
- index and slice your time series data in a data frame
- resample your time series for different time period aggregates/summary statistics
- compute a rolling statistic such as a rolling average
- work with missing data
- understand the basics of unix/epoch time
- understand common pitfalls of time series data analysis [SOURCE](https://towardsdatascience.com/basic-time-series-manipulation-with-pandas-4432afee64ea)

In this section, we will introduce how to work with each of these types of date/time data in Pandas. This short section is by no means a complete guide to the time series tools available in Python or Pandas, but instead is intended as a broad overview of how you as a user should approach working with time series [SOURCE](https://jakevdp.github.io/PythonDataScienceHandbook/03.11-working-with-time-series.html).

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">pd.to_datetime()</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

For more and detailed information about to_datetime() metod, please [Visit Official Document](https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html)

**``pd.to_datetime()``** Converts argument to datetime.

This function converts a **``scalar``**, **``array-like``**, **``Series``** or **``DataFrame/dict-like``** to a pandas datetime object.

**As stated above, many input types are supported, and lead to different output types:**

- **``scalars``** can be int, float, str, datetime object (from stdlib datetime module or numpy). They are converted to Timestamp when possible, otherwise they are converted to datetime.datetime. None/NaN/null scalars are converted to NaT.

- **``array-like``** can contain int, float, str, datetime objects. They are converted to DatetimeIndex when possible, otherwise they are converted to Index with object dtype, containing datetime.datetime. None/NaN/null entries are converted to NaT in both cases.

- **``Series``** are converted to Series with datetime64 dtype when possible, otherwise they are converted to Series with object dtype, containing datetime.datetime. None/NaN/null entries are converted to NaT in both cases.

- **``DataFrame/dict-like``** are converted to Series with datetime64 dtype. For each row a datetime is created from assembling the various dataframe columns. Column keys can be common abbreviations like [âyearâ, âmonthâ, âdayâ, âminuteâ, âsecondâ, âmsâ, âusâ, ânsâ]) or plurals of the same.

[Special Note :](https://pandas.pydata.org/docs/getting_started/intro_tutorials/09_timeseries.html)

As many data sets do contain datetime information in one of the columns, pandas input function like [pandas.read_csv()](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html#pandas.read_csv) and [pandas.read_json()](https://pandas.pydata.org/docs/reference/api/pandas.read_json.html#pandas.read_json) can do the transformation to dates when reading the data using the **``parse_dates parameter``** with a list of the columns to read as Timestamp.

Why are these **``pandas.Timestamp``** objects useful? Let's illustrate the added value with some example cases. In this sense, let us assume that we want to work with the dates in the column datetime as datetime objects instead of plain text:

In [ ]:
# pd.to_datetime # string , list_like vs vs gibi ifadeyi time tipine Ã§evirmeyi 
# .. saÄlar(EÄer time a dÃ¶nÃ¼ÅtÃ¼rÃ¼lebilecek bir halde ise)
# datetime a bir sÃ¼tunu Ã§evirdikten sonra araya dt koyarsam. YÄ±l, gÃ¼n, ay vs yi
# .. bana ayrÄ± ayrÄ± Ã§ekebilir
"""
date["year"] = date["year"].dt.year
date["month"] = date["year"].dt.month
date["day"] = date["year"].dt.day
date["hour"] = date["year"].dt.hour
date["minute"] = date["year"].dt.minute
"""
# Pandas kendi iÃ§erisinde modÃ¼llerle bunu yapabiliyor ama ayrÄ±ca
# .. Datetime module Ã¼ var
"""
class datetime date
class datetime time
class datetime datetime   # mikrosaniyeye kadar bilgi gÃ¶sterir
class datetime timedelta  # parantez iÃ§ine bilgiler yazÄ±p bunu 
# .. matematiksel iÅlemler iÃ§in kullanabilirim. Åu kadar gÃ¼n Ã¶ncesine git vs gibi
class datetime tzinfo
class datetime timezone

# Sadece class datetime datetime ve class datetime timedelta Ä± kullanacaÄÄ±z
"""


# strftime() & strptime()
# strftime() : datetime object sonuna .strftime() yazarsam iÃ§indeki formattaki
# .. ifadeye Ã§evir dersem o formata Ã§evirir ifadeyi
# strptime() : Sadece string bir ifadeyi datetime a Ã§eviriyor
# .. ÃrneÄin : "21 June, 2018" i veriyorum ben
# .. sonra vermesini istediÄim Åekilde iÃ§erdeki formatÄ± veriyorum o formatta
# .. veriyor
# Ama to_datetime Ã§ok daha geniÅ kapsamlÄ± bunlara nazaran

In [461]:
df = pd.read_csv("time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [462]:
df.info()  # order_date ve entry_date object olarak gÃ¶rÃ¼nÃ¼yor.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [189]:
# order_date ve entry_date sÃ¼tunlarÄ± le ilgili iÅlem yapabilmek iÃ§in ikisini de datetime 'a Ã§evirmemiz gerekiyor.

Initially, the values in datetime are character strings and do **NOT** provide any datetime operations (e.g. extract the year, day of the week,â¦). By applying the to_datetime function, pandas interprets the strings and convert these to datetime (i.e. ``datetime64[ns, UTC]``) objects. In pandas we call these datetime objects similar to datetime.datetime from the standard library as [pandas.Timestamp](https://pandas.pydata.org/docs/reference/api/pandas.Timestamp.html#pandas.Timestamp).

In [463]:
df.order_date  # tÃ¼rÃ¼ object

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

In [464]:
pd.to_datetime(df.order_date)  # str tÃ¼rÃ¼nde olan tarih verisini datetime'a Ã§evirmek iÃ§in

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [465]:
pd.to_datetime(df.entry_date)  # entry_date sÃ¼tunundaki verileri datetime'a Ã§evirmek iÃ§in

0     2018-12-04
1     2018-12-04
2     2018-12-04
3     2018-12-04
4     2018-12-04
         ...
906   2020-10-07
907   2020-10-07
908   2020-11-13
909   2020-11-24
910   2020-11-26
Name: entry_date, Length: 911, dtype: datetime64[ns]

In [466]:
df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])

# ilgili kolonlarÄ±mÄ±zÄ± datetime tÃ¼rÃ¼nde tarih iÃ§eren verilerle gÃ¼ncelledik.

In [357]:
df.info()  # order_date ve entry_date sÃ¼tunlarÄ±ndaki veriler artÄ±k datetime tÃ¼rÃ¼nde

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

Now let's apply some aggregate methods for Datatime object at the given dataset:

In [358]:
df.entry_date.min()  # sisteme en erken girenin tarihini bulmak iÃ§in 

# datetime obj. arkasÄ±ndan bazÄ± metodlarÄ± kullanarak istediÄim bilgilere ulaÅabilirim.

Timestamp('2018-12-04 00:00:00')

In [359]:
df.entry_date.max() # entry_date maks. bulduÄumda sisteme en son girenin tarihine ulaÅabilirim.

Timestamp('2020-11-26 00:00:00')

In [360]:
df.entry_date.max() - df.entry_date.min()  # iki tarih arasÄ±ndaki farkÄ± gÃ¶rmek iÃ§in

Timedelta('723 days 00:00:00')

In [361]:
a = pd.Series(["15-03-2020", "18-05-2019", "24-07-2018"])
a

0    15-03-2020
1    18-05-2019
2    24-07-2018
dtype: object

In [362]:
a.max()  # string bir seriden max alÄ±rsak sonuÃ§ yanlÄ±Å olur. Datetime'a Ã§evirmeden tarihlerin min/max alÄ±nmamalÄ±.

'24-07-2018'

In [363]:
a.max() - a.min()  # str deÄerler old. iÃ§in matematiksel iÅlemler de yapÄ±lamaz.

TypeError: unsupported operand type(s) for -: 'str' and 'str'

In [467]:
pd.to_datetime(a, format="%d-%m-%Y")

# a serisindeki verinin formatÄ±nÄ± format parametresi ile belirttiÄimizde datetime'a Ã§evrilirken buna dikkat edilir.
# Format uymazsa hata verir.

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Series.dt()</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Accessor object for datetimelike properties of the Series values [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html).

For a comprehensive information what the datetimelike properties, please visit [Official Pandas API Reference Document](https://pandas.pydata.org/pandas-docs/version/0.22/api.html#datetimelike-properties)

In [ ]:
# datetime'a Ã§evrilmiÅ verilerimizle ilgili iÅlemler yapmak iÃ§in
#  series.dt.metod() Ã¶zelliÄini kullanÄ±rÄ±z.

In [468]:
df.entry_date.dt.year  # sadece yÄ±l bilgilerini alÄ±r

0      2018
1      2018
2      2018
3      2018
4      2018
       ...
906    2020
907    2020
908    2020
909    2020
910    2020
Name: entry_date, Length: 911, dtype: int64

## it can be date, year, quarter, month, week, day, weekday, dayofweek, hour, minute, second, microsecond

In [469]:
df.entry_date.dt.quarter  # yÄ±lÄ±n hangi Ã§eyrerÄinde olduÄunu gÃ¶rmek iÃ§in

0      4
1      4
2      4
3      4
4      4
      ..
906    4
907    4
908    4
909    4
910    4
Name: entry_date, Length: 911, dtype: int64

In [470]:
df.entry_date.dt.dayofweek  # haftanÄ±n kaÃ§Ä±ncÄ± gÃ¼nÃ¼ olduÄunu gÃ¶rmek iÃ§in

0      1
1      1
2      1
3      1
4      1
      ..
906    2
907    2
908    4
909    1
910    3
Name: entry_date, Length: 911, dtype: int64

In [471]:
df.entry_date.dt.day_name()  # gÃ¼n adlarÄ±nÄ± gÃ¶rmek iÃ§in

0        Tuesday
1        Tuesday
2        Tuesday
3        Tuesday
4        Tuesday
         ...
906    Wednesday
907    Wednesday
908       Friday
909      Tuesday
910     Thursday
Name: entry_date, Length: 911, dtype: object

In [472]:
df.entry_date.dt.month_name()  # ay isimlerini gÃ¶rmek iÃ§in

0      December
1      December
2      December
3      December
4      December
         ...
906     October
907     October
908    November
909    November
910    November
Name: entry_date, Length: 911, dtype: object

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Datetime Module</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

The datetime module supplies classes for manipulating dates and times [SOURCE](https://docs.python.org/3/library/datetime.html).

### ``class datetime.datetime``

A combination of a date and a time. Attributes: year, month, day, hour, minute, second, microsecond, and tzinfo.

In [476]:
from datetime import datetime

In [377]:
datetime.now()  # bilgisayarÄ±nÄ±zdaki o anki tarih ve saat bilgisini alÄ±r

datetime.datetime(2022, 5, 12, 0, 50, 10, 149590)

In [378]:
print(datetime.now())  # daha gÃ¼zel bir gÃ¶rÃ¼ntÃ¼ iÃ§in

2022-05-12 00:50:10.835892

In [379]:
print(datetime.today())  # datetime.now() ile aynÄ±

2022-05-12 00:50:11.324949

In [380]:
current_datetime = datetime.now()
print(datetime.now())

# Bunu bir seride kullanmak isterseniz apply iÃ§erisinde kullanmak zorunda kalÄ±rsÄ±nÄ±z.
# Bu nedenle serilerde dt.metod() Åeklinde kullanmak daha mantÄ±klÄ± olur.

2022-05-12 00:50:11.960883

In [381]:
current_datetime.date()  # datetime object'e dÃ¶nÃ¼ÅtÃ¼rdÃ¼ktan sonra deÄiÅkenin ardasÄ±ndan istediÄim metodu Ã§aÄÄ±rarak Ã§alÄ±ÅtÄ±rÄ±p, istediÄim bilgiye ulaÅabilirim.

datetime.date(2022, 5, 12)

In [382]:
print(current_datetime.date())

2022-05-12

In [474]:
current_datetime.weekday()  # monday'i 0'dan baÅlatÄ±yor. Bu nedenle bugÃ¼ne(perÅembe) haftanÄ±n 3. gÃ¼nÃ¼ diye Ã§Ä±ktÄ± verdi.

3

In [384]:
current_datetime.isoweekday()  # monday'i 1'den baÅlatÄ±yor. Bu nedenle bugÃ¼ne(perÅembe) haftanÄ±n 4. gÃ¼nÃ¼ diye Ã§Ä±ktÄ± verdi.

4

In [473]:
current_datetime.weekday()

3

In [478]:
current_datetime.day

12

In [479]:
current_datetime.month

5

In [480]:
current_datetime.year

2022

### ``class datetime.timedelta``

A duration expressing the difference between two date, time, or datetime instances to microsecond resolution [SOURCE](https://www.geeksforgeeks.org/manipulate-date-and-time-with-the-datetime-module-in-python/).

In [220]:
from datetime import timedelta  # datetime'dan timedelta metodunu import etmek iÃ§in

In [221]:
timedelta(days=2)  # Zaman aralÄ±ÄÄ±nÄ± belirlemek iÃ§in kullanÄ±lÄ±r.

datetime.timedelta(days=2)

In [222]:
current_datetime

datetime.datetime(2022, 5, 11, 22, 40, 56, 222908)

In [224]:
two_days_before = current_datetime - timedelta(days = 2)  # Åu andaki zamandan 2 gÃ¼n Ã¶ncesini bulmak iÃ§in
two_days_before

datetime.datetime(2022, 5, 9, 22, 40, 56, 222908)

In [225]:
current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10)  # Åu andaki zamandan 2 hafta, 3 gÃ¼n, 4st, 10dk sonrasÄ±nÄ± bulmak iÃ§in

datetime.datetime(2022, 5, 29, 2, 50, 56, 222908)

In [226]:
# print ile yazdÄ±rdÄ±ÄÄ±mÄ±zda daha dÃ¼zgÃ¼n Ã§Ä±ktÄ± elde ediyoruz.

print(f"{'current_date': <15}", current_datetime)
print(f"{'plus': <15}", timedelta(weeks=2, hours=4, minutes=10))
print(f"{'total': <15}", current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10))

current_date    2022-05-11 22:40:56.222908
plus            14 days, 4:10:00
total           2022-05-29 02:50:56.222908

In [227]:
datetime.now()-pd.to_datetime("07.03.1974")  # Åu andaki zamandan doÄum gÃ¼nÃ¼nÃ¼zÃ¼ Ã§Ä±kardÄ±ÄÄ±nÄ±zda kaÃ§ gÃ¼n yaÅadÄ±ÄÄ±nÄ±zÄ± bulabilirsiniz.

Timedelta('17479 days 22:51:48.906678')

### ``strftime()``

**Converting** from date/datetime/timedelta object **to string type** [SOURCE](https://strftime.org/)

In [228]:
print(current_datetime)

2022-05-11 22:40:56.222908

In [229]:
current_datetime.year

2022

In [230]:
type(current_datetime.year)

int

**Watch out the difference.**

In [231]:
current_datetime.strftime("%Y")  # datetime tÃ¼rÃ¼nde olan bir zamanÄ± stringe dÃ¶nÃ¼ÅtÃ¼rmek iÃ§in kullanÄ±lÄ±r.

'2022'

In [232]:
type(current_datetime.strftime("%Y"))  # string olarak yÄ±l

str

In [481]:
current_datetime.year  # int olarak yÄ±l

2022

In [482]:
type(current_datetime.year)   # int olarak yÄ±l

int

In [233]:
year = current_datetime.strftime("%Y")
print("year:", year)
month = current_datetime.strftime("%m")
print("month:", month)
day = current_datetime.strftime("%d")
print("day:", day)
time = current_datetime.strftime("%H:%M:%S")
print("time:", time)
date_time = current_datetime.strftime("%m/%d/%Y, %H:%M:%S")
print("date and time:", date_time)

year: 2022
month: 05
day: 11
time: 22:40:56
date and time: 05/11/2022, 22:40:56

### strptime()

**Converting** from string type **to datetime object**

In [234]:
date_string = "21 June, 2018"
date_string

'21 June, 2018'

In [235]:
datetime.strptime(date_string, "%d %B, %Y")  # str ifadedeki tarih formatÄ±nÄ± datetime tÃ¼rÃ¼ne Ã§evirmek iÃ§in kullanÄ±lÄ±r.

# Strinf formattaki tarihin formatÄ±nÄ± doÄru bir Åekilde girmek gerekiyor.

datetime.datetime(2018, 6, 21, 0, 0)

In [236]:
pd.to_datetime(date_string)  # Burada format belirtmeden datetime'a Ã§evirebiliyoruz.

Timestamp('2018-06-21 00:00:00')

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Operation with Datetime Object</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

## Let's detect the time between first order date and entry date for each product

In [237]:
df

     id_product order_date  product_quantity  product_price entry_date
0           401 2021-01-23               1.0     541.487603 2018-12-04
1           416 2020-04-02               1.0     131.181818 2018-12-04
2           717 2019-03-10               1.0    2035.488500 2018-12-04
3           778 2019-12-27               1.0     335.988000 2018-12-04
4           826 2020-02-19               1.0     342.292302 2018-12-04
..          ...        ...               ...            ...        ...
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

[911 rows x 5 columns]

**Let us do it by string methods**

In [238]:
df.order_date - df.entry_date

0     781 days
1     485 days
2      96 days
3     388 days
4     442 days
        ...
906    48 days
907    48 days
908     9 days
909    63 days
910    10 days
Length: 911, dtype: timedelta64[ns]

In [239]:
df["time_delta"] = df.order_date - df.entry_date

In [240]:
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781 days
1,416,2020-04-02,1.0,131.181818,2018-12-04,485 days
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96 days
3,778,2019-12-27,1.0,335.988000,2018-12-04,388 days
4,826,2020-02-19,1.0,342.292302,2018-12-04,442 days
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48 days
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48 days
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9 days
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63 days
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10 days

In [242]:
df.time_delta.astype("str").str.split().str[0].astype("int")

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32

In [243]:
df["time_delta"] = df.time_delta.astype("str").str.split().str[0].astype("int")

In [244]:
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10

In [245]:
df.groupby("id_product")["time_delta"].min()

id_product
401        781
416        485
717         96
778        388
826        442
          ...
1536841     38
1536842     48
1536887      9
1536952     63
1536974     10
Name: time_delta, Length: 498, dtype: int32

In [246]:
df.groupby("id_product")["time_delta"].transform(min)

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: time_delta, Length: 911, dtype: int32

In [247]:
df["passing_time_to_firstsale"] = df.groupby("id_product")["time_delta"].transform(min)
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442
...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10

In [248]:
df.sort_values(by="id_product")

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442
...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10

## Let's detect the time between last order date and today for each product

**This time, let us do it by datetime properties**

In [249]:
datetime.today() - df.order_date

0      473 days 23:36:08.835468
1      769 days 23:36:08.835468
2     1158 days 23:36:08.835468
3      866 days 23:36:08.835468
4      812 days 23:36:08.835468
                 ...
906    533 days 23:36:08.835468
907    533 days 23:36:08.835468
908    535 days 23:36:08.835468
909    470 days 23:36:08.835468
910    521 days 23:36:08.835468
Name: order_date, Length: 911, dtype: timedelta64[ns]

In [259]:
df["passing_time_from_lastorderdate"] = (datetime.today() - df.order_date).astype("str").str.split().str[0].astype("int")

In [260]:
df

,id_product,order_date,product_quantity,product_price,entry_date,time_delta,passing_time_to_firstsale,passing_time_from_lastorderdate
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,781,473
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,485,769
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,96,1158
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,388,866
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,442,812
...,...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,533
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,48,533
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,9,535
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,63,470
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,10,521

In [263]:
df.groupby("id_product")["passing_time_from_lastorderdate"].min()

id_product
401         473
416         769
717        1158
778         866
826         812
           ...
1536841     535
1536842     533
1536887     535
1536952     470
1536974     521
Name: passing_time_from_lastorderdate, Length: 498, dtype: int32

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of Session - 10</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>